export const weddingName = 'Павел & Юлия'
export const weddingDate = '7 августа 2026 года'
export const weddingDateISO = '2026-08-07T14:45:00'
export const ourHistoryP1 = 'Эта история началась на первом курсе университета. Паша сразу заметил Юлю и с самого первого дня относился к ней с уважением. Юле он поначалу не понравился: казался слишком самоуверенным и любил подшучивать над другими. Тогда трудно было представить, что 7 лет спустя они будут планировать свадьбу...'
export const osP2 = 'Однажды на паре по математическому анализу Паша попросил Юлю помочь с задачей. Она очень удивилась: сам Паша, быстрее всех справлявшийся с любыми задачами, просит у неё помощи... Но помогла. Потом были совместные учебные проекты, подготовка к экзаменам и долгие разговоры. Сначала в компании, потом всё чаще вдвоём — и так незаметно зародилась их крепкая дружба.'
export const osP3 = 'Но Паша начал понимать, что Юля для него – не просто друг. Он не спешил, не настаивал, а просто был рядом — внимательно, бережно и по-настоящему. Шаг за шагом, год за годом он завоёвывал её доверие и сердце, и почти три года назад их дружба тихо переросла в любовь.'
export const osP4 = 'С тех пор у них появились общие планы, первый совместный отпуск, собака, о которой Юля мечтала с детства. И уверенность, что рядом — свой человек...'
export const osP5 = 'А когда настал тот самый момент, Паша, преодолев свой страх высоты, поднялся на вершину колеса обозрения и сделал Юле предложение.'
export const osP6 = 'И она сказала: «Да!».'
export const ourStory = [
  ourHistoryP1,
  osP2,
osP3,
osP4,
osP5,
osP6,
]

export const details = [
    {
      icon: "fas fa-ring",
      title: "Церемония",
      date: "08 августа 2026, 14:45",
      location: "Джанни Ресторани",
      address: "ул. Пискунова, 40, корп. 3, Нижний Новгород",
      mapLink: "https://maps.google.com",
      hasMap: true
    },
    {
      icon: "fas fa-glass-cheers",
      title: "Банкет",
      date: "08 августа 2026, 16:00",
     location: "Джанни Ресторани",
      address: "ул. Пискунова, 40, корп. 3, Нижний Новгород",
      mapLink: "https://maps.google.com",
      hasMap: true
    },
    {
      icon: "fas fa-tshirt",
      title: "Дресс-код",
      date: "Полуформальный",
      location: "Для дам: коктейльные или вечерние платья",
      address: "Для мужчин: костюмы",
      note: "Цветовая палитра: пастельные тона",
      hasMap: false
    },
  ];
export  const contacts = [
     {
      url: '/julia.webp',
      role: "Невеста",
      name: "Юлия Преображенская",
      description: "По всем организационным вопросам",
      phone: "+7 (910) 795-27-09",
      telegram: "@enjulia_17"
    },
    {
      url: '/pavel.webp',
      role: "Жених",
      name: "Павел Кулемин",
      description: "По всем организационным вопросам",
      phone: "+7 (930) 276-35-01",
      telegram: "@kulemin_p"
    },
  ];
  
  export const inviteText="Приглашаем Вас разделить с нами радость особого дня - дня нашей свадьбы!"
  export const links = [
    {
      title: 'Дата проведения',
      href: '#date'
    },
    {
      title: 'Место проведения',
      href: '#place'
    },
    {
      title:'Программа',
      href: '#program'
    },
    {
      title:'Детали',
      href: '#details'
    },
    {
      title: 'Анкета гостя',
      href: '#rsvp'
    }
  ]
  export const spirits=[
    ''
  ]